#ifndef ICONS_H
#define ICONS_H

#include <avr/pgmspace.h>

// Иконка GPU (Ширина: 16 пикселей, Высота: 8 пикселей)
const unsigned char gpu_icon[] PROGMEM = {
    B11100000, B00000000,
    B00111111, B11111110,
    B01100000, B00000001,
    B00101100, B10101001,
    B01101101, B01010101,
    B01100000, B00000001,
    B00111111, B11111110,
    B00101111, B11000000
};

// Иконка CPU (Ширина: 8 пикселей, Высота: 8 пикселей)
const unsigned char cpu_icon[] PROGMEM = {
    B00100100,
    B00111100,
    B11000011,
    B01001010,
    B01000010,
    B11000011,
    B00111100,
    B00100100
};

#endif


/* GPU
███.............
..█████████████.
.██............█
..█.██..█.█.█..█
.██.██.█.█.█.█.█
.██............█
..█████████████.
..█.██████......
*/

/* CPU
..█..█..
..████..
██....██
.█..█.█.
.█....█.
██....██
..████..
..█..█..
*/
